export default [
  {
    text: '前言',
    items: [
      {
        text: '网站的由来',
        link: '/主页/前言/index.md',
      },
      {
        text: '关于我😁',
        link: '/主页/前言/关于我.md',
      },
    ],
  },
  {
    text: '年终总结',
    items: [
      {
        text: '2020 的年终总结',
        link: '/主页/年终总结/2020年终总结.md',
      },
      {
        text: '2021 年终总结',
        link: '/主页/年终总结/2021年终总结.md',
      },
    ],
  },
  {
    text: '工具',
    items: [
      {
        text: 'prettier +vscode',
        link: '/主页/工具/格式化.md',
      },
      {
        text: '时序图',
        link: '/主页/工具/时序图.md',
      },
      {
        text: 'brew安装nvm',
        link: '/主页/工具/brew安装nvm.md',
      },
      {
        text: 'bug 清单',
        link: '/主页/工具/bugList.md',
      },
      {
        text: 'Git常用命令',
        link: '/主页/工具/Git常用命令.md',
      },
      {
        text: 'MongoDB命令',
        link: '/主页/工具/MongoDB命令.md',
      },
      {
        text: 'node内置模块',
        link: '/主页/工具/node内置模块.md',
      },
    ],
  },
];
