export default {
  "/面试/": [
    {
      "text": "http基础",
      "items": [
        {
          "text": "http基础",
          "link": "/面试/http基础/http基础.md"
        }
      ]
    }
  ],
  "/读书/": [
    {
      "text": "读书",
      "items": [
        {
          "text": "2020 的年终总结",
          "link": "/读书/2020读书笔记.md"
        },
        {
          "text": "2021读书笔记",
          "link": "/读书/2021读书笔记.md"
        },
        {
          "text": "2022读书笔记",
          "link": "/读书/2022读书笔记.md"
        },
        {
          "text": "书单",
          "link": "/读书/书单.md"
        }
      ]
    }
  ],
  "/记录/": [
    {
      "text": "记录",
      "items": [
        {
          "text": "猫十二",
          "link": "/记录/猫.md"
        },
        {
          "text": "长沙游记",
          "link": "/记录/长沙游记.md"
        }
      ]
    }
  ],
  "/算法题/": [
    {
      "text": "算法题",
      "items": [
        {
          "text": "列表",
          "link": "/算法题/index.md"
        }
      ]
    }
  ],
  "/源码分析/": [
    {
      "text": "源码分析",
      "items": [
        {
          "text": "前言",
          "link": "/源码分析/index.md"
        }
      ]
    },
    {
      "text": "vue2",
      "items": [
        {
          "text": "【初始化操作】入口文件分析",
          "link": "/源码分析/vue2/构造函数.md"
        },
        {
          "text": "【初始化操作】initMixin分析",
          "link": "/源码分析/vue2/initMixin.md"
        },
        {
          "text": "【初始化操作】stateMixin分析",
          "link": "/源码分析/vue2/stateMixin.md"
        },
        {
          "text": "【初始化操作】eventsMixin分析",
          "link": "/源码分析/vue2/eventsMixin.md"
        },
        {
          "text": "【初始化操作】lifecycleMixin 分析",
          "link": "/源码分析/vue2/lifecycleMixin.md"
        },
        {
          "text": "【初始化操作】renderMixin 分析",
          "link": "/源码分析/vue2/renderMixin.md"
        },
        {
          "text": "【初始化操作】initGlobalAPI分析",
          "link": "/源码分析/vue2/initGlobalAPI.md"
        },
        {
          "text": "【响应式原理】介绍",
          "link": "/源码分析/vue2/介绍.md"
        },
        {
          "text": "【响应式原理】props处理",
          "link": "/源码分析/vue2/props处理.md"
        }
      ]
    }
  ],
  "/技术/": [
    {
      "text": "技术",
      "items": [
        {
          "text": "前言",
          "link": "/技术/index.md"
        }
      ]
    }
  ],
  "/主页/": [
    {
      "text": "前言",
      "items": [
        {
          "text": "网站的由来",
          "link": "/主页/前言/index.md"
        },
        {
          "text": "关于我😁",
          "link": "/主页/前言/关于我.md"
        }
      ]
    },
    {
      "text": "年终总结",
      "items": [
        {
          "text": "2020 的年终总结",
          "link": "/主页/年终总结/2020年终总结.md"
        },
        {
          "text": "2021 年终总结",
          "link": "/主页/年终总结/2021年终总结.md"
        }
      ]
    },
    {
      "text": "工具",
      "items": [
        {
          "text": "prettier +vscode",
          "link": "/主页/工具/格式化.md"
        },
        {
          "text": "时序图",
          "link": "/主页/工具/时序图.md"
        },
        {
          "text": "brew安装nvm",
          "link": "/主页/工具/brew安装nvm.md"
        },
        {
          "text": "bug 清单",
          "link": "/主页/工具/bugList.md"
        },
        {
          "text": "Git常用命令",
          "link": "/主页/工具/Git常用命令.md"
        },
        {
          "text": "MongoDB命令",
          "link": "/主页/工具/MongoDB命令.md"
        },
        {
          "text": "node内置模块",
          "link": "/主页/工具/node内置模块.md"
        }
      ]
    }
  ]
}